<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>Insert title here</title>
<link rel="stylesheet" href="css/login_form.css">
  <link rel="stylesheet"
	href="https://maxcdn.bootstrapcdn.com/bootstrap/4.0.0/css/bootstrap.min.css">
</head>
<body>
<form action="createAccount2.jsp">
<div class="contentsWrap" >
    <div class="window" >
      <a href="login.jsp"><img src="img/on_spot_text.png" id="onSpotLogo"></a>
      
      <h5>제 1장 총칙</h5>
     <textarea rows="5" cols="130" >제 1 조 (목적)
본 약관은 OLIS(Opensource-software License Information System) 웹 사이트 (이하 "당 사이트")가 제공하는 모든 서비스(이하 "서비스")의 이용조건 및 절차, 이용자와 당 사이트간의 권리, 의무, 책임사항과 기타 필요한 사항을 규정함을 목적으로 합니다.
      
제 2 조 (약관의 효력과 변경)
1. 본 약관의 내용은 서비스 화면에 게시하거나 기타의 방법으로 회원에게 공지함으로써 효력을 발생합니다.
2. 당 사이트는 이용자가 본 약관 내용에 동의하는 것을 조건으로 이용자에게 서비스를 제공할 것이며, 이용자가 본 약관의 내용에 동의하는 경우, 당 사이트의 서비스 제공 행위 및 이용자의 서비스 사용 행위에는 본 약관이 우선적으로 적용될 것입니다.
3. 당 사이트는 본 약관을 사전 고지 없이 변경할 수 있으며, 변경된 약관은 당 사이트 내에 공지함으로써 이용자가 직접 확인하도록 할 것입니다. 이용자는 언제든지 당 사이트의 이용약관 메뉴를 통해 새롭게 갱신된 이용약관의 내용을 보실 수 있습니다. 이용자가 변경된 약관에 동의하지 아니하는 경우, 이용자는 본인의 회원등록을 취소 (회원탈퇴)할 수 있으며, 계속 사용의 경우는 약관 변경에 대한 동의로 간주됩니다. 변경된 약관은 공지와 동시에 그 효력이 발생됩니다.
        
제 3 조 (약관 외 준칙)       
본 약관에 명시되지 않은 사항은 전기통신기본법, 전기통신사업법, 정보통신윤리위원회심의규정, 정보통신 윤리강령, 저작권법 및 기타 관련 법령의 규정에 의합니다.

제 4 조 (용어의 정의)      
본 약관에서 사용하는 용어의 정의는 다음과 같습니다.
1. 이용자 : 본 약관에 따라 당 사이트가 제공하는 서비스를 받는 자.
2. 회원 : 당 사이트와 서비스 이용에 관한 계약을 체결한 자
3. 아이디(ID) : 회원 식별과 회원의 서비스 이용을 위하여 회원이 선정하고 당 사이트가 승인하는 문자와 숫자의 조합
4. 비밀번호 : 회원이 통신상의 자신의 비밀을 보호하기 위해 선정한 문자와 숫자의 조합
5. 해지 : 당 사이트 또는 회원이 서비스 이용 이후 그 이용계약을 종료 시키는 의사 표시
6. 컨텐츠 : 당 사이트에서 서비스 하는 문자, 그래픽, 파일, SW를 지칭
7. 본 약관에서 정의하지 않은 용어는 개별서비스에 대한 별도약관 및 이용규정에서 정의합니다.</textarea>
     
     <input type="checkbox" name="checkbox" id="checkbox" required><label>위 약관에 동의합니다.</label>
     
     <h5>제 2장 이용계약의 체결</h5>
     <textarea rows="5" cols="130" >제 1 조 (목적)
제 5 조 (이용 계약의 성립)
1. 이용계약은 신청자가 온라인으로 당 사이트에서 제공하는 소정의 가입신청 양식에서 요구하는 사항을 기록하여 가입을 완료하고 회원가입 버튼을 누르는 것으로 성립됩니다.
2. 이용계약은 회원 1인당 1개의 ID로 체결하는 것을 원칙으로 합니다.
3. 단, 유관기관 등 기관 명의로 가입하는 경우 2개의 ID를 동일인이 부여받을 수 있습니다.

제 6 조 (이용신청의 불승낙)
1. 당 사이트는 다음에 해당하는 이용신청에 대하여는 등록을 거부하거나 등록 후에라도 고지 없이 회원정보를 수정 또는 삭제할 수 있습니다.
    1. 명의도용의 경우
    2. 신청서를 허위기재한 경우
    3. 기타 신청자의 귀책사유로 이용승낙이 곤란한 경우
2. 당 사이트는 다음에 해당하는 이용신청에 대하여 승낙 제한 사유가 해소 될 때까지 승낙을 유보 할 수 있습니다.
    1. 당 사이트 설비의 여유가 없는 경우
    2. 당 사이트의 기술상 지장이 있는 경우
    3. 기타 당 사이트가 필요하다고 인정하는 경우
3. 
당 사이트는 이용신청이 불승낙 되거나 승낙을 제한하는 경우에는 이를 신청자에게 통보해야 합니다.

제 7 조 (회원정보 공유에 대한 동의)
1. 회원의 개인정보에 대해서는 당 사이트의 개인정보 보호방침이 적용됩니다.
2. 당 사이트의 회원 정보는 다음과 같이 수집, 사용, 관리, 보호됩니다.
    1. 개인정보의 수집: 당 사이트는 이용자의 당 사이트 서비스 가입시 이용자가 제공하는 정보를 통하여 이용자에 관한 정보를 수집합니다.
    2. 개인정보의 사용: 당 사이트는 당 사이트 서비스 제공과 관련해서 수집된 회원의 신상 정보를 본인의 승낙 없이 제3자에게 누설, 배포하지 않습니다. 단, 전기통신기본법 등 법률의 규정에 의해 국가기관의 요구가 있는 경우, 범죄에 대한 수사상의 목적이 있는 경우 또는 기타 관계법령에서 정한 절차에 따른 요청이 있는 경우에는 그러하지 않습니다.
    3. 개인정보의 관리: 이용자는 개인정보의 보호 및 관리를 위하여 당 사이트의 개인정보 관리에서 수시로 이용자의 개인정보를 수정/삭제할 수 있습니다. 수신되는 정보 중 불필요하다고 생각되는 부분도 변경/조정할 수 있습니다.
    4. 개인정보의 보호: 이용자의 개인정보는 오직 이용자만이 열람/수정/삭제 할 수 있으며, 이는 전적으로 이용자의 ID와 비밀번호에 의해 관리되고 있습니다. 따라서 타인에게 본인의 ID와 비밀번호를 알려주어서는 아니되며, 작업 종료 시에는 반드시 로그아웃 해주시고, 웹 브라우저의 창을 닫아주시기 바랍니다. (이는 타인과 컴퓨터를 공유하는 인터넷 카페나 도서관 같은 공공장소에서 컴퓨터를 사용하는 경우에 이용자의 정보의 보호를 위하여 필요한 사항입니다)
3. 회원이 당 사이트에 본 약관에 따라 이용신청을 하는 것은 당 사이트가 본 약관에 따라 신청서에 기재된 회원정보를 수집, 이용하는 것에 동의하는 것으로 간주됩니다.

제 8 조 (정보 제공 및 홍보물 개제)
1. 당 사이트는 서비스를 운영함에 있어서 각종 정보를 당 사이트에 게재하는 방법 등으로 회원에게 제공할 수 있습니다.
2. 당 사이트는 서비스에 적절하다고 판단되거나 활용 가능성 있는 홍보물을 게재할 수 있습니다.

제 9 조 (이용자의 정보 보안)
1. 가입 신청자가 당 사이트 회원가입 절차를 완료하는 순간부터 이용자는 입력한 정보의 비밀을 유지할 책임이 있으며, 회원의 ID와 비밀번호를 사용하여 발생하는 모든 결과에 대한 책임은 회원본인에게 있습니다.
2. ID와 비밀번호에 관한 모든 관리의 책임은 회원에게 있으며, 회원의 ID나 비밀번호가 부정하게 사용되었다는 사실을 발견한 경우에는 즉시 당 사이트에 신고하여야 합니다. 신고를 하지 않음으로 인한 모든 책임은 회원 본인에게 있습니다.
3. 이용자는 당 사이트 서비스의 사용 종료시 마다 정확히 접속을 종료하도록 해야 하며, 정확히 종료하지 아니함으로써 제3자가 이용자에 관한 정보를 이용하게 되는 등의 결과로 인해 발생하는 손해 및 손실에 대하여 당 사이트는 책임을 부담하지 아니합니다.
</textarea>        
<br><input type="checkbox" name="checkbox" id="checkbox" required><label>위 약관에 동의합니다.</label>  
  
<h5>제 3장 서비스의 이용</h5>
<textarea rows="5" cols="130">
제 10 조 (서비스의 이용 시간)
1. 서비스 이용시간은 당 사이트의 업무상 또는 기술상 특별한 지장이 없는 한 연중 무휴, 1일 24시간을 원칙으로 합니다.
2. 제1항의 이용시간은 정기점검 등의 필요로 인하여 당 사이트가 정한 날 또는 시간은 예외로 합니다.

제 11 조 (서비스의 중지 및 정보의 저장과 사용)
1. 이용자는 당 사이트 서비스로 인해 발생된 컨텐츠를 보관되거나 전송된 메시지 및 기타 통신 메시지 등의 내용이 국가의 비상사태, 정전, 당 사이트의 관리 범위 외의 서비스 설비 장애 및 기타 불가항력에 의하여 보관되지 못 하였거나 삭제된 경우, 전송되지 못한 경우 및 기타 통신 데이터의 손실이 있을 경우에 당 사이트는 관련 책임을 부담하지 아니합니다.
2. 당 사이트가 정상적인 서비스 제공(컨텐츠 포함)의 어려움으로 인하여 일시적으로 서비스를 중지하여야 할 경우에는 서비스 중지 1주일 전에 고지한 후 컨텐츠 등 당 사이트의 서비스를 중지할 수 있으며, 이 기간 동안 이용자가 고지내용을 인지하지 못한 데 대하여 당 사이트는 책임을 부담하지 아니합니다. 부득이한 사정이 있을 경우 위 사전 고지 기간은 감축되거나 생략될 수 있습니다. 또한 당 사이트 서비스 중지에 따라 발생된 컨텐츠가 보관되거나 전송된 메시지 및 기타 통신 메시지 등의 내용이 보관되지 못하였거나 삭제된 경우, 전송되지 못한 경우 및 기타 통신 데이터의 손실이 있을 경우에 대하여도 당 사이트는 책임을 부담하지 아니합니다.
3. 당 사이트의 사정으로 서비스를 영구적으로 중단하여야 할 경우 제 2 항에 의거합니다. 다만, 이 경우 사전 고지기간은 1개월로 합니다.
4. 당 사이트는 사전 고지 후 서비스를 일시적으로 수정, 변경 및 중단할 수 있으며, 이에 대하여 이용자 또는 제3자에게 어떠한 책임도 부담하지 아니합니다.
5. 당 사이트는 이용자가 본 약관의 내용에 위배되는 행동을 한 경우, 임의로 서비스 사용을 제한 및 중지할 수 있습니다. 이 경우 당 사이트는 위 이용자의 접속을 금지할 수 있습니다.</textarea>
     
     <input type="checkbox" name="checkbox" id="checkbox" required><label>위 약관에 동의합니다.</label>
     <button class="btn btn-outline-primary" type="button" name="Check All" onClick="this.value=check(this.form.checkbox)">전부 동의</button>
      <hr class="nonehr">
     <button class="btn btn-outline-primary" type="submit">다음 페이지</button>
     </div></div>
</form>
<script>
var checkflag = "false";
function check(field) {
if (checkflag == "false") {
for (i = 0; i < field.length; i++) {
field[i].checked = true;}
checkflag = "true"; 
}
else {
for (i = 0; i < field.length; i++) {
field[i].checked = false; }
checkflag = "false";
}
}
</script>
</body>
</html>